[
  {
    "id": 1,
    "title": "Local-Vibes Event Management Platform",
    "summary": "Built a full-stack local event discovery and management platform using Go with Chi router, Vue.js 3, and SQLite. Implemented secure authentication, fuzzy search with Supabase backend, real-time event CRUD operations, and personalized dashboards enabling 20+ beta testers to create, discover, and join community events with custom rules and capacity management.",
    "repo_url": "https://github.com/nithish-95/college-event-management-app",
    "description_html": "<p>Built a comprehensive full-stack local event discovery and management platform using Go with Chi router for the backend API, Vue.js 3 with Vue Router for the frontend SPA, and SQLite for data persistence. Implemented secure user authentication with session management and pseudonymous profiles for privacy. Developed fuzzy search functionality using Supabase backend with ilike operators and wildcard pattern matching, enabling users to discover events with partial or misspelled keywords across titles and descriptions. Created personalized event dashboards displaying hosted and joined events, full CRUD operations for event management, one-click event joining/leaving functionality, and custom event rules configuration. Features include event capacity management, Tailwind CSS responsive design, and Vite build optimization. Achieved positive feedback from 20+ beta testers and significantly boosted campus community engagement.</p>",
    "image_url": ""
  },
  {
    "id": 2,
    "title": "Chat Application",
    "summary": "Designed a scalable chat platform for an Advanced OS course project inspired by Discord using Go, WebSockets, and implementing consistent hashing and rate limiting across 8 nodes, which enabled real-time communication for 30+ testers and demonstrated potential to scale to 2,500+ users. deployed on AWS with Docker and CI/CD, supporting clients with low as 10ms latency and 40% faster deployment.",
    "repo_url": "https://github.com/nithish-95/chat-application",
    "description_html": "<p>Designed a scalable chat platform for an Advanced OS course project inspired by Discord using Go, WebSockets, and implementing consistent hashing and rate limiting across 8 nodes, which enabled real-time communication for 30+ testers and demonstrated potential to scale to 2,500+ users. deployed on AWS with Docker and CI/CD, supporting clients with low as 10ms latency and 40% faster deployment.</p>",
    "image_url": ""
  },
  {
    "id": 3,
    "title": "Tweets Sentiment Analysis",
    "summary": "Developed a high-performance sentiment analysis engine for an Introduction to Big Data course by leveraging Llama-2, LangChain, Apache Spark, and AWS to process 10,000+ tweets/hour with 92.2% accuracy, delivering real-time insights via a responsive dashboard and reducing processing time by 30%.",
    "repo_url": "https://github.com/nithish-95/tweets-sentiment-analysis",
    "description_html": "<p>Developed a high-performance sentiment analysis engine for an Introduction to Big Data course by leveraging Llama-2, LangChain, Apache Spark, and AWS to process 10,000+ tweets/hour with 92.2% accuracy, delivering real-time insights via a responsive dashboard and reducing processing time by 30%.</p>",
    "image_url": ""
  },
  {
    "id": 4,
    "title": "Realtime Multiplayer Tic Tac Toe",
    "summary": "Designed a Realtime multiplayer Tic-Tac-Toe game that can be played from multiple devices.",
    "repo_url": "https://github.com/nithish-95/realtime-multiplayer-tic-tac-toe",
    "description_html": "<p>Designed a Realtime multiplayer Tic-Tac-Toe game that can be played from multiple devices.</p>",
    "image_url": ""
  },
  {
    "id": 5,
    "title": "MangaFlow Reader",
    "summary": "Built a full-stack manga reading platform using Go with Chi router, featuring MangaDex API integration, concurrent image processing with goroutines, in-memory caching, and a responsive Tailwind CSS interface supporting search, popular/recent manga listings, chapter navigation, and Docker deployment.",
    "repo_url": "https://github.com/nithish-95/manga",
    "description_html": "<p>Built a full-stack manga reading platform using Go with Chi router, featuring MangaDex API integration, concurrent image processing with goroutines, in-memory caching for improved performance, and a responsive Tailwind CSS interface. Implemented search functionality, popular/recent manga listings, paginated chapter navigation, and image proxy for CORS handling. Deployed with Docker multi-stage builds for optimized production containers.</p>",
    "image_url": ""
  },
  {
    "id": 6,
    "title": "AI Recipe Generator",
    "summary": "Developed a serverless AI-powered recipe generator using React, TypeScript, AWS Amplify, and Claude 3 Sonnet via AWS Bedrock. Implemented user authentication with AWS Cognito, GraphQL API for recipe generation, and custom resolvers for AI integration, delivering personalized recipe suggestions from user-provided ingredients.",
    "repo_url": "https://github.com/nithish-95/ai-recipe-generator",
    "description_html": "<p>Developed a serverless AI-powered recipe generator using React, TypeScript, and Vite for the frontend, integrated with AWS Amplify Gen 2 for backend infrastructure. Leveraged AWS Bedrock to access Anthropic's Claude 3 Sonnet model for intelligent recipe generation based on user-provided ingredients. Implemented secure user authentication with AWS Cognito, GraphQL API with custom HTTP data sources, and IAM policies for Bedrock access. Built responsive UI with AWS Amplify UI components and deployed with automated CI/CD pipeline.</p>",
    "image_url": ""
  },
  {
    "id": 7,
    "title": "LLM CLI Chat Bot",
    "summary": "Built a versatile command-line AI chat interface in Go using Cobra CLI framework and LangChain, supporting multiple LLM providers including OpenAI GPT, Google Gemini, and local Ollama models with streaming responses, conversation history management, and graceful interrupt handling.",
    "repo_url": "https://github.com/nithish-95/llm-cli",
    "description_html": "<p>Built a versatile command-line AI chat interface in Go using the Cobra CLI framework and LangChain Go library, supporting multiple LLM providers including OpenAI GPT-4, Google Gemini AI (with Vertex AI integration), and local Ollama models (CodeLlama). Implemented real-time streaming responses, persistent conversation history with system prompts, graceful signal handling for interrupts, and environment variable configuration. Features colored terminal output for enhanced UX and context-aware multi-turn conversations with configurable temperature and token limits.</p>",
    "image_url": ""
  }
]
